Autodesk.Revit.DB.SiteLocation.SaveToLinkType(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.String,System.String)
Save the site into specific LinkType, if the type has one already, it will be updated
document:
The document of the LinkType.
linkTypeId:
The LinkType to be saved into.
geoSiteName:
The site name to save.
geoCoordinateSystem:
The coordinate system name to save.
Returns:
The saved site.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The element linkTypeId does not exist in the document
-or-
geoSiteName cannot include prohibited characters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2019

Autodesk.Revit.DB.SiteLocation.DownloadWeatherFile(System.String)
Downloads the weather file at this site location, used for systems energy analysis.
weatherFolder:
The folder location where the downloaded weather file will be stored.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
No weather station is within 500 nautical miles of this site location.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
Fail to download the weather file.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Unable to access the weather service. Try again later.
Since:
2020.1